src/InformationRegisters/Scan_ДанныеПоАКБИзделий/Scan_ДанныеПоАКБИзделий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ДанныеПоАКБИзделий</name>
  <comment>Данные по АКБ продуктов (scania)</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ПусковойТок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Плотность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НапряжениеБезНагрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НапряжениеПодНагрузкой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Емкость</name>
    <type>
      <types>CatalogRef.Scan_ЕмкостиАКБ</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.Scan_СостоянияАКБ</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>АКБ</name>
    <type>
      <types>CatalogRef.Scan_АккумуляторныеБатареи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/Scan_ХарактеристикиАКБ/Scan_ХарактеристикиАКБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_ХарактеристикиАКБ</name>
  <enumValues>
    <name>Плотность</name>
  </enumValues>
  <enumValues>
    <name>ПусковойТок</name>
  </enumValues>
  <enumValues>
    <name>НапряжениеБезНагрузки</name>
  </enumValues>
  <enumValues>
    <name>НапряжениеПодНагрузкой</name>
  </enumValues>
</mdclass:Enum>

src/InformationRegisters/Scan_ДанныеПоАКБИзделий/Forms/ФормаЗаписи/Module.bsl
// rarus tenkam 14.03.2018 mantis 12900 +++

&НаКлиенте
Процедура ХарактеристикаПриИзменении(Элемент)
	СоответствиеХарактеристик = Новый Соответствие;
	СоответствиеХарактеристик.Вставить(ПредопределенноеЗначение("Перечисление.Scan_ХарактеристикиАКБ.ПусковойТок"), Запись.ПусковойТок);
	СоответствиеХарактеристик.Вставить(ПредопределенноеЗначение("Перечисление.Scan_ХарактеристикиАКБ.Плотность"), Запись.Плотность);
	СоответствиеХарактеристик.Вставить(ПредопределенноеЗначение("Перечисление.Scan_ХарактеристикиАКБ.НапряжениеБезНагрузки"), Запись.НапряжениеБезНагрузки);
	СоответствиеХарактеристик.Вставить(ПредопределенноеЗначение("Перечисление.Scan_ХарактеристикиАКБ.НапряжениеПодНагрузкой"), Запись.НапряжениеПодНагрузкой);
	СоответствиеХарактеристик.Вставить("Емкость", Запись.Емкость);
	Запись.Состояние = ПолучитьСостояние(СоответствиеХарактеристик);
КонецПроцедуры

&НаСервереБезКОнтекста
Функция ПолучитьСостояние(СоответствиеХарактеристик)
	Возврат Справочники.Scan_СостоянияАКБ.ПолучитьСостояниеПоХарактеристикам(СоответствиеХарактеристик);	
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
КонецПроцедуры   

// rarus tenkam 14.03.2018 mantis 12900 ---
